### DataFrame

In [ ]:
from pyspark import SparkConf , SparkContext
from pyspark.sql import SQLContext

In [ ]:
conf = SparkConf().setMaster('local').setAppName('sparkApp')
spark = SparkContext(conf=conf)
spark

In [ ]:
sqlCtx = SQLContext(spark)
sqlCtx

- csv 파일을 이용한 dataframe 만들기

In [ ]:
orders = sqlCtx.read.csv('/data.orders.csv' , header=True , inferSchema=True)
orders.printSchema()

In [ ]:
orders.describe.show()

In [ ]:
orders.summary().show()

In [ ]:
orders.first()

In [ ]:
# 검색 select()
orders.select(['OrderID' , 'CustomerID']).show()

In [ ]:
# withColumn
# orders.show()
orders.withColumn('newOrderID' , orders['OrderID']+2).show()

In [ ]:
# 컬럼 이름 변경
orders.withColumnRenamed('OrderID' , 'renameOrderID').show()

In [ ]:
# grouopBy() - 집계함수
orders.groupBy('EmployeeID').count().show()

In [ ]:
cospi =  sqlCtx.read.csv('/data.cospi.csv' , header=True , inferSchema=True)
type(cospi)

In [ ]:
orders.printSchema()

In [ ]:
# filter(조건식)
# 날짜가 2월인 데이터만 필터링
orders.filter(orders['Date'] >= '2016-02-01').show()

In [ ]:
# 종가가 1154000 이상인 데이터만 필터링
orders.filter(orders['Close'] >= '1154000').select(['Date' , 'Open' , 'Close']).show()

In [ ]:
orders.filter( (orders['Open'] > 1200000) & (orders['Open' > 1250000]) )

In [ ]:
orders.filter( (orders['Open'] > 1200000) | (orders['Open' > 1250000]) )

In [ ]:
# Volume 30000 이하인 데이터 필터링
order.filter( ~(orders['Volume'] > 300000 ) ).show()

In [ ]:
# 날짜가 2.26 인 데이터 필터링
order.filter( ~(orders['Date'] == '2016-02-26' ) ).show()

In [ ]:
# data - titanic_train.csv
titanic =  sqlCtx.read.csv('/data.titanic_train.csv' , header=True , inferSchema=True)
type( titanic )

In [ ]:
titanic.show()

In [ ]:
titanic.columns

- count()

In [ ]:
titanic.count()

In [ ]:
- select 변수 선택 PassengerId , Name
titanic.select(['PassengerId' , 'Name']).show()

In [ ]:
# 성별이 여성이면서 살아 있는 'PassengerId' , 'Name', 'Sex', 'Survived'  출력
titanic.filter( (titanic.Sex == 'female') & (titanic.Survived == 1) ).select(['PassengerId' , 'Name', 'Sex', 'Survived' ]).show()

In [ ]:
# 선실등급 별 요금 평균 확인
# class_grp = titanic.groupBy('Pclass')
# class_grp.count().show()
# class.grp.avg('Fare').show()
# type( class_grp )

# 정렬 sort()
titanic.groupBy('Pclass').avg('Fare').sort('avg(Fare)' , ascending=False).show()

### Spark DB 연동

In [ ]:
from pyspark import SparkConf , SparkContext
from pyspark.sql import SQLContext

In [5]:
import pandas as pd

In [6]:
data1 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Name' : {0:'Owen', 1:'Florence', 2:'Laina', 3:'Lily', 4:"William"},
         'sex' : {0: 'male', 1: 'female', 2:'female', 3:'female', 4:'male'},
         'Survived': {0:0, 1:1, 2:1, 3:1, 4:0}
        }

data2 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Age' : {0: 22, 1: 38, 2: 33, 3: 35, 4: 35},
         'Fare' : {0: 7.3, 1: 71.3, 2:7.9, 3:53.1, 4:8.0},
         'Pclass': {0:3, 1:1, 2:3, 3:1, 4:3}
        }

In [7]:
# data1.keys()
# data2.keys()

- pandas df -> spark df

In [10]:
sample_df01 = pd.DataFrame(data1 , columns=data1.keys())
sampl_df02 = pd.DataFrame(data2 , columns=data2.keys())
display(sample_df01)
display(sample_df01)
type(sample_df01)

   PassengerId      Name     sex  Survived
0            1      Owen    male         0
1            2  Florence  female         1
2            3     Laina  female         1
3            4      Lily  female         1
4            5   William    male         0

   PassengerId      Name     sex  Survived
0            1      Owen    male         0
1            2  Florence  female         1
2            3     Laina  female         1
3            4      Lily  female         1
4            5   William    male         0

pandas.core.frame.DataFrame

In [11]:
# pandas -> spark type 의 DF 로 만드는 방법
spark_df01 = sqlCtx.createDataFrame(sample_df01)
type(spark_df01)

spark_df02 = sqlCtx.createDataFrame(sample_df02)
type(spark_df02)

NameError: name 'sqlCtx' is not defined

In [ ]:
spark_df01.printSchema()

In [ ]:
spark_df02.printSchema()

In [ ]:
spark_df01.show()

In [ ]:
spark_df02.show()

In [ ]:
# mirroring
spark_df01.createOrReplaceTempVeiw('titanic01')
spark_df02.createOrReplaceTempVeiw('titanic02')

In [ ]:
spark.sql('select * from titanic01').show()

In [ ]:
sqlCtx.sql("select * from titanic01 where sex='male' ").show()

In [ ]:
# 성별에 따른 생존자 수 구하기
sqlCtx.sql("""    SELECT SEX , COUNT(SURVIVED) AS CNT
                        FROM TITANIC01
                        GROUP BY SEX""").show()

In [12]:
taxi_train_file_loc = "wasb://mllibwalkthroughs@cdspsparksamples.blob.core.windows.net/Data/NYCTaxi/JoinedTaxiTripFare.Point1Pct.Train.tsv"